In [13]:
import xlrd
import MySQLdb
import pandas as pd

# from datetime import datetime
import datetime

In [14]:
# 1. Establish a MySQL connection
database = MySQLdb.connect (host="localhost", user = "root", passwd = "1234", db = "dm_course_v25")
v = 'v25'

### Country

In [15]:
name_file = 'Country'
data = pd.read_csv(f'data/{v}/{name_file}.csv')
data.head()

         Country  Country_ID
0  United States           1

In [16]:
# 1. The name of table
name_table = 'Country'

# 2. Get the cursor, which is used to traverse the database, line by line
cursor = database.cursor()
# 3. query
query = f"""INSERT INTO {name_table} (Country, Country_ID) VALUES (%s, %s)"""

for i in range(len(data)):
    values =  (data.iloc[i,0], data.iloc[i,1])
#     print(values)
    cursor.execute(query, values)
    
# Close the cursor
cursor.close()
# Commit the transaction
database.commit()
# Close the database connection
# database.close()

# 5. Status
print('ETL - copleted')

ETL - copleted

### Region

In [17]:
name_file = 'Region'
data = pd.read_csv(f'data/{v}/{name_file}.csv')
data.head()

  Region_name  Country_ID  Region_ID
0       South           1          1
1        West           1          2
2     Central           1          3
3        East           1          4

In [18]:
data = data[['Region_ID', 'Region_name', 'Country_ID']]

In [19]:
# 1. The name of table
name_table = 'region'

# 2. Get the cursor, which is used to traverse the database, line by line
cursor = database.cursor()
# 3. query
query = f"""INSERT INTO {name_table} (Region_ID, Region_name, Country_ID) VALUES (%s, %s, %s)"""

for i in range(len(data)):
    values =  (data.iloc[i,0], data.iloc[i,1], data.iloc[i,2])
#     print(values)
    cursor.execute(query, values)
    
# Close the cursor
cursor.close()
# Commit the transaction
database.commit()
# Close the database connection
# database.close()

# 5. Status
print('ETL - copleted')

ETL - copleted

### State

In [20]:
name_file = 'State'
data = pd.read_csv(f'data/{v}/{name_file}.csv')
data.head()

            State  Region_ID  State_ID
0        Kentucky          1         1
1         Florida          1         2
2  North Carolina          1         3
3        Virginia          1         4
4       Tennessee          1         5

In [21]:
data = data[['State_ID', 'State', 'Region_ID']]
data.head()

   State_ID           State  Region_ID
0         1        Kentucky          1
1         2         Florida          1
2         3  North Carolina          1
3         4        Virginia          1
4         5       Tennessee          1

In [22]:
# 1. The name of table
name_table = 'state'

# 2. Get the cursor, which is used to traverse the database, line by line
cursor = database.cursor()
# 3. query
query = f"""INSERT INTO {name_table} (State_ID, State, Region_ID) VALUES (%s, %s, %s)"""

for i in range(len(data)):
    values =  (data.iloc[i,0], data.iloc[i,1], data.iloc[i,2])
#     print(values)
    cursor.execute(query, values)
    
# Close the cursor
cursor.close()
# Commit the transaction
database.commit()
# Close the database connection
# database.close()

# 5. Status
print('ETL - copleted')

ETL - copleted

### City

In [23]:
name_file = 'City'
data = pd.read_csv(f'data/{v}/{name_file}.csv')
data.head()

         City  State_ID  City_ID
0   Henderson         1        1
1    Richmond         1        2
2  Louisville         1        3
3    Florence         1        4
4      Murray         1        5

In [24]:
data = data[['City_ID', 'City', 'State_ID']]
# data.head()

In [25]:
# 1. The name of table
name_table = 'city'

# 2. Get the cursor, which is used to traverse the database, line by line
cursor = database.cursor()
# 3. query
query = f"""INSERT INTO {name_table} (City_ID, City, State_ID) VALUES (%s, %s, %s)"""

for i in range(len(data)):
    values =  (data.iloc[i,0], data.iloc[i,1], data.iloc[i,2])
#     print(values)
    cursor.execute(query, values)
    
# Close the cursor
cursor.close()
# Commit the transaction
database.commit()
# Close the database connection
# database.close()

# 5. Status
print('ETL - copleted')

ETL - copleted

### Customer

In [26]:
name_file = 'Customer'
data = pd.read_csv(f'data/{v}/{name_file}.csv')
data.head()

  Customer_ID   Customer_Name    Segment
0    CG-12520     Claire Gute   Consumer
1    DK-12985  Darren Koutras   Consumer
2    RD-19585        Rob Dowd   Consumer
3    KC-16255  Karen Carlisle  Corporate
4    AB-10105   Adrian Barton   Consumer

In [27]:
# data = data[['City_ID', 'City', 'State_ID']]
# data.head()

In [28]:
# 1. The name of table
name_table = 'customer'

# 2. Get the cursor, which is used to traverse the database, line by line
cursor = database.cursor()
# 3. query
query = f"""INSERT INTO {name_table} (Customer_ID, Customer_Name, Segment) VALUES (%s, %s, %s)"""

for i in range(len(data)):
    values =  (data.iloc[i,0], data.iloc[i,1], data.iloc[i,2])
#     print(values)
    cursor.execute(query, values)
    
# Close the cursor
cursor.close()
# Commit the transaction
database.commit()
# Close the database connection
# database.close()

# 5. Status
print('ETL - copleted')

ETL - copleted

### Postal

In [29]:
name_file = 'postal'
data = pd.read_csv(f'data/{v}/{name_file}.csv')
data.head()

   Postal_Code  City_ID  Postal_Code_ID
0        42420        1               1
1        40475        2               2
2        40214        3               3
3        41042        4               4
4        42071        5               5

In [30]:
data = data[['Postal_Code', 'City_ID', 'Postal_Code_ID']]
# data.head()

In [31]:
# 1. The name of table
name_table = 'postal'

# 2. Get the cursor, which is used to traverse the database, line by line
cursor = database.cursor()
# 3. query
query = f"""INSERT INTO {name_table} (Postal_Code, City_ID, Postal_Code_ID) VALUES (%s, %s, %s)"""

for i in range(len(data)):
    values =  (data.iloc[i,0], data.iloc[i,1], data.iloc[i,2])
#     print(values)
    cursor.execute(query, values)
    
# Close the cursor
cursor.close()
# Commit the transaction
database.commit()
# Close the database connection
# database.close()

# 5. Status
print('ETL - copleted')

ETL - copleted

### Customer_Address

In [32]:
name_file = 'Customer_Address'
data = pd.read_csv(f'data/v20/{name_file}.csv')
data.head()

  Customer_ID  Postal_Code_ID  Customer_address_ID
0    CG-12520               1                    1
1    DK-12985               1                    2
2    RD-19585               1                    3
3    KC-16255               1                    4
4    AB-10105               1                    5

In [33]:
# data = data[['City_ID', 'City', 'State_ID']]
# data.head()

In [34]:
# 1. The name of table
name_table = 'customer_address'

# 2. Get the cursor, which is used to traverse the database, line by line
cursor = database.cursor()
# 3. query
query = f"""INSERT INTO {name_table} (Customer_ID, Postal_Code_ID, Customer_address_ID) VALUES (%s, %s, %s)"""

for i in range(len(data)):
    values =  (data.iloc[i,0], data.iloc[i,1], data.iloc[i,2])
#     print(values)
    cursor.execute(query, values)
    
# Close the cursor
cursor.close()
# Commit the transaction
database.commit()
# Close the database connection
# database.close()

# 5. Status
print('ETL - copleted')

ETL - copleted

### Order

In [35]:
name_file = 'Order'
data = pd.read_csv(f'data/{v}/{name_file}.csv')
data.head()

         Order_ID  Order_Date   Ship_Date       Ship_Mode  Customer_address_ID
0  CA-2020-152156  2020-11-08  2020-11-11    Second Class                    1
1  CA-2019-134894  2019-12-07  2019-12-11  Standard Class                    2
2  CA-2019-162537  2019-10-28  2019-11-03  Standard Class                    3
3  CA-2019-109470  2019-12-31  2020-01-03    Second Class                    4
4  CA-2021-101042  2021-11-19  2021-11-23  Standard Class                    5

In [36]:
# data['Order_Date'] = pd.to_datetime(data['Order_Date'], format="%Y-%m-%d")
# data['Ship_Date'] = pd.to_datetime(data['Ship_Date'], format="%Y-%m-%d")
# data.head()

In [37]:
# 1. The name of table
name_table = 'order'

# 2. Get the cursor, which is used to traverse the database, line by line
cursor = database.cursor()
# 3. query
query = f"""INSERT INTO dm_course_v25.{name_table} (Order_ID, Order_Date, Ship_Date, Ship_Mode, Customer_address_ID) VALUES (%s, %s, %s, %s, %s)"""

for i in range(len(data)):
    values =  (data.iloc[i,0],
               data.iloc[i,1], 
               data.iloc[i,2], 
               data.iloc[i,3],
               data.iloc[i,4])
#     print(values)
    cursor.execute(query, values)
    
# Close the cursor
cursor.close()
# Commit the transaction
database.commit()
# Close the database connection
# database.close()

# 5. Status
print('ETL - copleted')

ETL - copleted

### Category

In [38]:
name_file = 'Category'
data = pd.read_csv(f'data/{v}/{name_file}.csv')
data.head()

     Category_Name  Category_ID
0        Furniture            1
1  Office Supplies            2
2       Technology            3

In [39]:
data = data[['Category_ID', 'Category_Name']]
# data.head()

In [40]:
# 1. The name of table
name_table = 'category'

# 2. Get the cursor, which is used to traverse the database, line by line
cursor = database.cursor()
# 3. query
query = f"""INSERT INTO {name_table} (Category_ID, Category_Name) VALUES (%s, %s)"""

for i in range(len(data)):
    values =  (data.iloc[i,0], data.iloc[i,1])
#     print(values)
    cursor.execute(query, values)
    
# Close the cursor
cursor.close()
# Commit the transaction
database.commit()
# Close the database connection
# database.close()

# 5. Status
print('ETL - copleted')

ETL - copleted

### SubCategory

In [41]:
name_file = 'subcategory'
data = pd.read_csv(f'data/{v}/{name_file}.csv')
data.head()

   Category_ID SubCategory_Name  SubCategory_ID
0            1        Bookcases               1
1            1           Chairs               2
2            1      Furnishings               3
3            1           Tables               4
4            2       Appliances               5

In [42]:
data = data[['SubCategory_ID', 'SubCategory_Name', 'Category_ID']]
# data.head()

In [43]:
# 1. The name of table
name_table = 'subcategory'

# 2. Get the cursor, which is used to traverse the database, line by line
cursor = database.cursor()
# 3. query
query = f"""INSERT INTO {name_table} (SubCategory_ID, SubCategory_Name, Caterogy_ID) VALUES (%s, %s, %s)"""

for i in range(len(data)):
    values =  (data.iloc[i,0], data.iloc[i,1], data.iloc[i,2])
#     print(values)
    cursor.execute(query, values)
    
# Close the cursor
cursor.close()
# Commit the transaction
database.commit()
# Close the database connection
# database.close()

# 5. Status
print('ETL - copleted')

ETL - copleted

### product

In [44]:
name_file = 'product'
data = pd.read_csv(f'data/{v}/{name_file}.csv')
data.head()

,Product_Name,SubCategory_ID,Product_ID
0,Bush Somerset Collection Bookcase,1,1
1,O'Sullivan Manor Hill 2-Door Library in Briann...,1,2
2,Bush Mission Pointe Library,1,3
3,O'Sullivan Living Dimensions 2-Shelf Bookcases,1,4
4,O'Sullivan 2-Shelf Heavy-Duty Bookcases,1,5

In [45]:
data = data[['Product_ID', 'Product_Name', 'SubCategory_ID']]
# data.head()

In [46]:
# 1. The name of table
name_table = 'product'

# 2. Get the cursor, which is used to traverse the database, line by line
cursor = database.cursor()
# 3. query
query = f"""INSERT INTO {name_table} (Product_ID, Product_Name, SubCategory_ID) VALUES (%s, %s, %s)"""

for i in range(len(data)):
    values =  (data.iloc[i,0], data.iloc[i,1], data.iloc[i,2])
#     print(values)
    cursor.execute(query, values)
    
# Close the cursor
cursor.close()
# Commit the transaction
database.commit()
# Close the database connection
# database.close()

# 5. Status
print('ETL - copleted')

ETL - copleted

### Order_Product

In [47]:
name_file = 'Order_Product'
data = pd.read_csv(f'data/{v}/{name_file}.csv')
data.head()

         Order_ID  Product_ID    Sales  Quantity   Profit  Discount
0  CA-2020-152156           1  261.960         2  41.9136      0.00
1  CA-2021-110198           1  314.352         3 -15.7176      0.20
2  CA-2020-117681           1  556.665         5   6.5490      0.15
3  CA-2021-159793           1  130.980         2 -89.0664      0.50
4  CA-2021-124765           2  723.920         5 -81.4410      0.20

In [48]:
# data = data[['Order_ID', 'Product_ID', 'Sales', 'Quantity', 'Profit',' Discount']]
# data.head()

In [49]:
# 1. The name of table
name_table = 'order_product'

# 2. Get the cursor, which is used to traverse the database, line by line
cursor = database.cursor()
# 3. query
query = f"""INSERT INTO dm_course_v25.{name_table} (Order_ID, Product_ID, Sales, Quantity, Profit, Discount) VALUES (%s, %s, %s, %s, %s, %s)"""

for i in range(len(data)):
    values =  (data.iloc[i,0], data.iloc[i,1], data.iloc[i,2], data.iloc[i,3], data.iloc[i,4], data.iloc[i,5])
#     print(values)
    cursor.execute(query, values)
    
# Close the cursor
cursor.close()
# Commit the transaction
database.commit()
# Close the database connection
# database.close()

# 5. Status
print('ETL - copleted')

ETL - copleted